app/Controllers/Officer/OfficerController.php

    public function profile()
    {
        $session = session();
        $officerId = (int) $session->get('id');

        $officer = $this->userModel->find($officerId);
        if (!$officer) {
            return redirect()->to(base_url('officer'))->with('error', 'Officer profile not found.');
        }

        $records = $this->violationRecord
            ->where('officer_id', $officerId)
            ->orderBy('violation_date', 'DESC')
            ->findAll();

        $totalAmount = array_sum(array_map(static function ($record) {
            return (float) ($record['penalty_amount'] ?? 0);
        }, $records));

        $data = [
            'title'          => 'My Profile',
            'officer'        => $officer,
            'records'        => $records,
            'pendingCount'   => count(array_filter($records, static fn($r) => ($r['status'] ?? '') === 'Pending')),
            'paidCount'      => count(array_filter($records, static fn($r) => ($r['status'] ?? '') === 'Paid')),
            'cancelledCount' => count(array_filter($records, static fn($r) => ($r['status'] ?? '') === 'Cancelled')),
            'totalAmount'    => $totalAmount,
            // Chart Data: Violations by Type
            'violationsByType' => $this->violationRecord
                ->select('violation_type, COUNT(*) as count')
                ->where('officer_id', $officerId)
                ->groupBy('violation_type')
                ->orderBy('count', 'DESC')
                ->limit(5)
                ->findAll(),
            // Chart Data: Monthly Trend (Current Year)
            'monthlyTrend' => $this->violationRecord
                ->select('MONTH(violation_date) as month, COUNT(*) as count')
                ->where('officer_id', $officerId)
                ->where('YEAR(violation_date)', date('Y'))
                ->groupBy('MONTH(violation_date)')
                ->orderBy('month', 'ASC')
                ->findAll(),
---
SELECT *
FROM `users`
WHERE `users`.`id` = 7
SELECT *
FROM `violations`
WHERE `officer_id` = 7
ORDER BY `violation_date` DESC
SELECT `violation_type`, COUNT(*) as count
FROM `violations`
WHERE `officer_id` = 7
GROUP BY `violation_type`
ORDER BY `count` DESC
 LIMIT 5
SELECT MONTH(violation_date) as month, COUNT(*) as count
FROM `violations`
WHERE `officer_id` = 7
AND YEAR(violation_date) = '2026'
GROUP BY MONTH(violation_date)
ORDER BY `month` ASC

        $db->transStart();

        foreach ($violationTypeIds as $violationTypeId) {
            $violationType = $this->violationTypeModel->find((int) $violationTypeId);
            if (!$violationType) continue;

            $data = [
                'ticket_id'        => $sharedTicketId,
                'first_name'       => $firstName,
                'last_name'        => $lastName,
                'age'              => (int) $this->request->getPost('age'),
                'address'          => trim((string) $this->request->getPost('address')),
                'driver_name'      => trim($firstName . ' ' . $lastName),
                'license_plate'    => $licensePlate,
                'officer_id'       => $session->get('id'),
                'violation_type_id' => (int) $violationTypeId,
                'violation_type'   => $violationType['violation_name'],
                'penalty_amount'   => (float) ($violationType['fine_amount'] ?? 0),
                'points'           => (int) ($violationType['points'] ?? 0),
                'status'           => 'Pending',
                'violation_date'   => date('Y-m-d H:i:s'),
                'created_by'       => $session->get('id'),
                'location'         => trim($this->request->getPost('location') ?? ''),
                'notes'            => trim($this->request->getPost('notes') ?? ''),
            ];

            if ($this->violationRecord->save($data)) {
---
SELECT *
FROM `violation_types`
WHERE `violation_types`.`id` = 5
SELECT *
FROM `violation_types`
WHERE `status` = 'active'
INSERT INTO `violations` (`ticket_id`, `first_name`, `last_name`, `age`, `address`, `driver_name`, `license_plate`, `officer_id`, `violation_type_id`, `violation_type`, `penalty_amount`, `points`, `status`, `violation_date`, `created_by`, `location`, `notes`, `created_at`, `updated_at`) VALUES ('TKT-345404D5', 'Mj', 'Laurito', 24, 'Bocana', 'Mj Laurito', '15682', '7', 5, 'Using Mobile While Driving', 100, 2, 'Pending', '2026-05-12 05:53:59', '7', 'Ilog 1', '', '2026-05-12 05:53:59', '2026-05-12 05:53:59')

    public function violations()
    {
        $officerId = (int) session()->get('id');

        $data = [
            'title' => 'Violation',
            'violationTypes' => $this->violationTypeModel->where('status', 'active')->findAll(),
            'violations' => $this->violationRecord
                ->select('violations.*, GROUP_CONCAT(violation_type SEPARATOR "||") as concatenated_violations, SUM(penalty_amount) as total_penalty_sum, SUM(points) as total_points_sum')
                ->where('officer_id', $officerId)
                ->groupBy('ticket_id')
                ->orderBy('violation_date', 'DESC')
                ->paginate(10, 'violations'),
            'pager' => $this->violationRecord->pager,
        ];
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `violations`.*, GROUP_CONCAT(violation_type SEPARATOR "||") as concatenated_violations, SUM(penalty_amount) as total_penalty_sum, SUM(points) as total_points_sum
FROM `violations`
WHERE `officer_id` = 7
GROUP BY `ticket_id`
) CI_count_all_results
SELECT `violations`.*, GROUP_CONCAT(violation_type SEPARATOR "||") as concatenated_violations, SUM(penalty_amount) as total_penalty_sum, SUM(points) as total_points_sum
FROM `violations`
WHERE `officer_id` = 7
GROUP BY `ticket_id`
ORDER BY `violation_date` DESC
 LIMIT 10