app/Controllers/Admin/AdminController.php

    public function analytics()
    {
        $monthlyTrend = $this->violationRecord->getMonthlyTrend();
        $violationTypesSummary = $this->violationRecord->getViolationTypesSummary();
        $statusDistribution = $this->violationRecord->getStatusDistribution();

        $totalCollected = $this->violationRecord->getTotalRevenue();
        $totalPending = $this->violationRecord->getOutstandingFines();
        $totalViolations = $this->violationRecord->countAll();

        $collectionRate = $totalViolations > 0 ? ($this->violationRecord->getPaidCount() / $totalViolations) * 100 : 0;

        $userRoleDistribution = $this->users
            ->select('role, COUNT(*) as count')
            ->groupBy('role')
            ->findAll();

        $userStatusDistribution = $this->users
            ->select('status, COUNT(*) as count')
            ->groupBy('status')
            ->findAll();

        $violationTypeCatalog = [
            'active' => $this->violationTypes->where('status', 'active')->countAllResults(),
            'inactive' => $this->violationTypes->where('status', 'inactive')->countAllResults(),
        ];
---
SELECT COUNT(*) AS `numrows` FROM `violations`
SELECT `role`, COUNT(*) as count
FROM `users`
GROUP BY `role`
SELECT `status`, COUNT(*) as count
FROM `users`
GROUP BY `status`
SELECT COUNT(*) AS `numrows`
FROM `violation_types`
WHERE `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `violation_types`
WHERE `status` = 'inactive'

            'status_distribution' => $statusDistribution,
            'user_role_distribution' => $userRoleDistribution,
            'user_status_distribution' => $userStatusDistribution,
            'summary' => [
                'total_collected' => $totalCollected,
                'total_pending' => $totalPending,
                'total_violations' => $totalViolations,
                'collection_rate' => round($collectionRate, 1),
                'top_violation' => $violationTypesSummary[0]['violation_type'] ?? 'None',
                'total_users' => $this->users->countAll(),
                'total_officers' => $this->users->where('role', 'enforcer')->countAllResults(),
                'violation_types_active' => $violationTypeCatalog['active'],
            ]
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'enforcer'
SELECT COUNT(*) AS `numrows` FROM `users`