app/Controllers/Admin/OfficerController.php

SELECT *
FROM `violation_types`
WHERE `status` = 'active'
---
    public function index()
    {
        $data = [
            'title' => 'Record Violation',
            'violationTypes' => $this->violationTypeModel->where('status', 'active')->findAll(),