app/Controllers/Admin/PenaltyController.php

    public function all()
    {
        $data = [
            'title' => 'All Violations',
            'violations' => $this->violationRecord->select('violations.*, users.username as officer_name')
                                                   ->join('users', 'users.id = violations.officer_id', 'left')
                                                   ->orderBy('violations.violation_date', 'DESC')
                                                   ->paginate(10, 'all'),
---
SELECT COUNT(*) AS `numrows`
FROM `violations`
LEFT JOIN `users` ON `users`.`id` = `violations`.`officer_id`
SELECT `violations`.*, `users`.`username` as `officer_name`
FROM `violations`
LEFT JOIN `users` ON `users`.`id` = `violations`.`officer_id`
ORDER BY `violations`.`violation_date` DESC
 LIMIT 10

    public function history()
    {
        $data = [
            'title' => 'Payment History',
            'payments' => $this->violationRecord->where('status', 'Paid')
                                                 ->orderBy('paid_date', 'DESC')
                                                 ->paginate(10, 'history'),
            'pager' => $this->violationRecord->pager,
        ];
---
SELECT *
FROM `violations`
WHERE `status` = 'Paid'
ORDER BY `paid_date` DESC