app/Controllers/Admin/UserController.php

    public function index()
    {
        $role = (string) ($this->request->getGet('role') ?? '');
        $allowedRoles = ['admin', 'driver', 'enforcer'];

        $usersQuery = $this->userModel;
        if ($role !== '' && in_array($role, $allowedRoles, true)) {
            $usersQuery = $usersQuery->where('role', $role);
        } else {
            $role = '';
        }

        $data = [
            'title' => 'User Management',
            'selectedRole' => $role,
            'users' => $usersQuery->findAll(),
        ];
---
SELECT *
FROM `users`
WHERE `role` = 'user'
SELECT *
FROM `users`
WHERE `role` = 'enforcer'

    public function edit($id = null)
    {
        $user = $this->userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function update($id = null)
    {
        $user = $this->userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '7'

            $data['password'] = $this->request->getPost('password');
        }

        if ($this->userModel->save($data)) {
---
UPDATE `users` SET `username` = 'janrey', `firstname` = 'Janrey', `lastname` = 'Calamba', `age` = 20, `address` = 'Mambugsay', `email` = 'janrey@gmail.com', `role` = 'enforcer', `status` = 'active', `password` = '$2y$10$3HUP9NtpfQ.OXj8qLofqY.jeedSmO2tsFtq93iGgPjlJ3BtZrvPE2', `updated_at` = '2026-04-30 04:17:15'
WHERE `users`.`id` IN ('7')