app/Controllers/Admin/ViolationTypeController.php

SELECT *
FROM `violation_types`
ORDER BY `violation_name` ASC
---
    public function index()
    {
        $data = [
            'title' => 'Violation Types',
            'violationTypes' => $this->violationTypeModel->orderBy('violation_name', 'ASC')->findAll(),