app/Controllers/InspectionController.php

SELECT *
FROM `inspections`
WHERE `inspections`.`deleted_at` IS NULL
ORDER BY `inspection_date` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `inspections`
WHERE `inspections`.`deleted_at` IS NULL
---
    public function index()
    {
        $data = [
            'title' => 'Inspections',
            'inspections' => $this->inspectionModel->orderBy('inspection_date', 'DESC')->paginate(10, 'inspections'),