app/Models/AnalyticModel.php

    public function getDashboardStats()
    {
        return [
            'total_violations'  => $this->countAll(),
            'pending_penalties' => $this->where('status', 'Pending')->countAllResults(),
            'paid_penalties'    => $this->where('status', 'Paid')->countAllResults(),
            'total_revenue'     => $this->selectSum('penalty_amount')
                                        ->where('status', 'Paid')
                                        ->first()['penalty_amount'] ?? 0,
        ];
---
SELECT SUM(`penalty_amount`) AS `penalty_amount`
FROM `violations`
WHERE `status` = 'Paid'
 LIMIT 1