app/Models/ViolationRecord.php

    public function getPendingCount()
    {
        return $this->where('status', 'Pending')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `violations`
WHERE `status` = 'Pending'

    public function getPaidCount()
    {
        return $this->where('status', 'Paid')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `violations`
WHERE `status` = 'Paid'

    public function getCancelledCount()
    {
        return $this->where('status', 'Cancelled')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `violations`
WHERE `status` = 'Cancelled'

    public function getTotalRevenue()
    {
        return $this->selectSum('penalty_amount')
                    ->where('status', 'Paid')
                    ->findAll()[0]['penalty_amount'] ?? 0;
---
SELECT SUM(`penalty_amount`) AS `penalty_amount`
FROM `violations`
WHERE `status` = 'Paid'

    public function getRecentViolations($limit = 10)
    {
        return $this->select('violations.*, users.username as officer_name')
                    ->join('users', 'users.id = violations.officer_id', 'left')
                    ->orderBy('violations.created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();
---
SELECT `violations`.*, `users`.`username` as `officer_name`
FROM `violations`
LEFT JOIN `users` ON `users`.`id` = `violations`.`officer_id`
ORDER BY `violations`.`created_at` DESC
 LIMIT 5

    public function getStatistics()
    {
        return [
            'total_violations'    => $this->countAll(),
            'pending'            => $this->getPendingCount(),
            'paid'               => $this->getPaidCount(),
            'cancelled'          => $this->getCancelledCount(),
            'total_revenue'      => $this->getTotalRevenue(),
        ];
---
SELECT COUNT(*) AS `numrows` FROM `violations`

    public function getViolationTypesSummary()
    {
        // Prefer canonical names from violation_types when linked, but fall back to the stored text.
        return $this->select("IFNULL(vt.violation_name, violations.violation_type) as violation_type, COUNT(*) as count, SUM(violations.penalty_amount) as total_amount")
                    ->join('violation_types vt', 'vt.id = violations.violation_type_id', 'left')
                    ->groupBy('violations.violation_type_id, violations.violation_type, vt.violation_name')
                    ->orderBy('count', 'DESC')
                    ->findAll();
---
SELECT IFNULL(vt.violation_name, violations.violation_type) as violation_type, COUNT(*) as count, SUM(violations.penalty_amount) as total_amount
FROM `violations`
LEFT JOIN `violation_types` `vt` ON `vt`.`id` = `violations`.`violation_type_id`
GROUP BY `violations`.`violation_type_id`, `violations`.`violation_type`, `vt`.`violation_name`
ORDER BY `count` DESC

    public function getMonthlyTrend($year = null)
    {
        $year = $year ?? date('Y');

        // Initialize 12 months with 0
        $trend = array_fill(1, 12, ['count' => 0, 'revenue' => 0]);

        $results = $this->select("MONTH(violation_date) as month, COUNT(*) as count, SUM(CASE WHEN status = 'Paid' THEN penalty_amount ELSE 0 END) as revenue")
                        ->where('YEAR(violation_date)', $year)
                        ->groupBy('MONTH(violation_date)')
                        ->orderBy('month', 'ASC')
                        ->findAll();
---
SELECT MONTH(violation_date) as month, COUNT(*) as count, SUM(CASE WHEN status = 'Paid' THEN penalty_amount ELSE 0 END) as revenue
FROM `violations`
WHERE YEAR(violation_date) = '2026'
GROUP BY MONTH(violation_date)
ORDER BY `month` ASC

    public function getStatusDistribution()
    {
        return $this->select('status, COUNT(*) as count')
                    ->groupBy('status')
                    ->findAll();
---
SELECT `status`, COUNT(*) as count
FROM `violations`
GROUP BY `status`

    public function getOutstandingFines()
    {
        return $this->selectSum('penalty_amount')
                    ->where('status', 'Pending')
                    ->findAll()[0]['penalty_amount'] ?? 0;
---
SELECT SUM(`penalty_amount`) AS `penalty_amount`
FROM `violations`
WHERE `status` = 'Pending'