app/Models/ViolatorRecord.php

    public function getRecentViolations($limit = 10)
    {
        return $this->select('violations.*, users.username as officer_name')
                    ->join('users', 'users.id = violations.officer_id', 'left')
                    ->orderBy('violations.created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();
---
SELECT `violations`.*, `users`.`username` as `officer_name`
FROM `violations`
LEFT JOIN `users` ON `users`.`id` = `violations`.`officer_id`
ORDER BY `violations`.`created_at` DESC
 LIMIT 5

    public function getStatistics()
    {
        return [
            'total_violations'    => $this->countAll(),
            'pending'            => $this->getPendingCount(),
            'paid'               => $this->getPaidCount(),
            'cancelled'          => $this->getCancelledCount(),
            'total_revenue'      => $this->getTotalRevenue(),
        ];
---
SELECT COUNT(*) AS `numrows` FROM `violations`

    public function getViolationTypesSummary()
    {
        // Prefer canonical names from violation_types when linked, but fall back to the stored text.
        return $this->select("IFNULL(vt.violation_name, violations.violation_type) as violation_type, COUNT(*) as count, SUM(violations.penalty_amount) as total_amount")
                    ->join('violation_types vt', 'vt.id = violations.violation_type_id', 'left')
                    ->groupBy('violations.violation_type_id, violations.violation_type, vt.violation_name')
                    ->orderBy('count', 'DESC')
                    ->findAll();
---
SELECT IFNULL(vt.violation_name, violations.violation_type) as violation_type, COUNT(*) as count, SUM(violations.penalty_amount) as total_amount
FROM `violations`
LEFT JOIN `violation_types` `vt` ON `vt`.`id` = `violations`.`violation_type_id`
GROUP BY `violations`.`violation_type_id`, `violations`.`violation_type`, `vt`.`violation_name`
ORDER BY `count` DESC